{
  "posts": [
    {
      "id": 1,
      "userId": "jschnurer",
      "title": "Post 1 - A fun sample post",
      "body": "dignissimos aperiam dolorem qui eum facilis quibusdam animi sint suscipit qui sint possimus cum quaerat magni maiores excepturi ipsam ut commodi dolor voluptatum modi aut vitae",
      "time": "2020-03-06 13:15:00Z"
    },
    {
      "id": 2,
      "userId": "jschnurer",
      "title": "Post 2 - A not so fun post",
      "body": "minus omnis soluta quia qui sed adipisci voluptates illum ipsam voluptatem eligendi officia ut in eos soluta similique molestias praesentium blanditiis",
      "time": "2020-03-08 19:44:00Z"
    },
    {
      "id": 3,
      "userId": "jschnurer",
      "title": "Post 3 - A really not fun post!",
      "body": "alias dolor cumque impedit blanditiis non eveniet odio maxime blanditiis amet eius quis tempora quia autem rem a provident perspiciatis quia",
      "time": "2020-03-10 09:54:00Z"
    }
  ],
  "comments": [
    {
      "id": 1,
      "userId": "t3h_PeNgU1N_oF_d00m",
      "body": "First!",
      "postId": 1,
      "time": "2020-03-10 14:00:00Z"
    },
    {
      "id": 2,
      "userId": "philosoraptor08",
      "body": "Second... :(",
      "postId": 1,
      "time": "2020-03-10 14:20:00Z"
    },
    {
      "id": 3,
      "userId": "BATTLE_BROTHER",
      "body": "You're right. This WAS a not-so-fun post.",
      "postId": 2,
      "time": "2020-03-10 11:15:00Z"
    }
  ],
  "users": [
    {
      "id": "jschnurer",
      "joinDate": "2019-10-21 18:33:12Z",
      "blurb": "Just, oh, you know, the guy who made this whole thing."
    },
    {
      "id": "BATTLE_BROTHER",
      "joinDate": "2019-11-12 06:53:21Z",
      "blurb": "GREETINGS BATTLE BROTHERS I AM NEW. HOLDS UP BOLTER MY NAME IS SERGEANT ARGUS BUT YOU CAN CALL ME BATTLE BROTHER. AS YOU CAN SEE I AM VERY LOYAL TO THE EMPEROR. THAT IS WHY I HAVE COME HERE, TO MEET OTHER BATTLE BROTHERS WHO ARE LOYAL TO THE EMPEROR LIKE MYSELF. I AM 127 YEARS OF AGE ( PRAISE THE EMPEROR) I LIKE TO PURGE HERETICS AND XENO SCUM WITH MY BATTLE BROTHERS ( I LOVE MY BATTLE BROTHERS, IF YOU DO NOT LIKE THAT THE DEAL WITH IT) IT IS OUR FAVORITE ACTIVITY BECAUSE THEY ARE NOT LOYAL TO THE EMPEROR. ALL MY BATTLE BROTHERS ARE LOYAL TO THE EMPEROR TOO OF COURSE, BUT I WANT TO MEET MORE LOYAL SERVANTS OF THE EMPEROR. LIKE THE EMPEROR ONCE SAID, THE MORE THE MERRIER. I HOPE TO BOND WITH A LARGE AMOUNT OF LOYAL SERVANTS OF THE EMPEROR SO JOIN ME IN PRAISE OF THE EMPEROR. FAREWELL.\nPRAISE THE EMPEROR\nBATTLE BROTHER"
    },
    {
      "id": "philosoraptor08",
      "joinDate": "2019-12-25 03:33:33Z",
      "blurb": "Has anyone really been far even as decided to use even go want to do look more like?\nYou've got to be kidding me. I've been further even more decided to use even go need to do look more as anyone can. Can you really be far even as decided half as much to use go wish for that? My guess is that when one really been far even as decided once to use even go want, it is then that he has really been far even as decided to use even go want to do look more like. It's just common sense. My guess is that when one really go to waits in expansion has entrance in deciding for which it is really far even to use go want despite boundaries overlooking like more does; which does hinderances of all being aside this are mine."
    },
    {
      "id": "t3h_PeNgU1N_oF_d00m",
      "joinDate": "2020-01-18 17:00:41Z",
      "blurb": "hi every1 im new!!!!!!! *holds up spork* my name is katy but u can call me t3h PeNgU1N oF d00m!!!!!!!! lol…as u can see im very random!!!! thats why i came here, 2 meet random ppl like me ^_^… im 13 years old (im mature 4 my age tho!!) i like 2 watch invader zim w/ my girlfreind (im bi if u dont like it deal w/it) its our favorite tv show!!! bcuz its SOOOO random!!!! shes random 2 of course but i want 2 meet more random ppl =) like they say the more the merrier!!!! lol…neways i hope 2 make alot of freinds here so give me lots of commentses!!!!\nDOOOOOMMMM!!!!!!!!!!!!!!!! <--- me bein random again ^_^ hehe…toodles!!!!!\n\nlove and waffles,\n\nt3h PeNgU1N oF d00m"
    },
	{
	  "id": "personUsingTheSiteRightNow",
      "joinDate": "2020-03-12 12:00:00Z",
      "blurb": "I'm just some person who is running the React Redux Typescript Example and testing out the features."
	}
  ],
  "profile": {
    "name": "jschnurer"
  }
}